import { create } from "zustand";

interface IRecipes {
    id: number
    label: string,
    ingredients: string[],
    instruction: string[],
    category: string,
    imageId: number
}

interface IRecipesState {    
    recipes: IRecipes[]    
}

const useRecipes = create<IRecipesState>()(
    set => ({        
        recipes: [
            {
                id: 1,
                label: "КРЕМ-СУП ІЗ БРОКОЛІ",
                ingredients: ["Заморожена броколі", "Морква", "Цибуля ріпчаста", "Сир плавлений вершковий", "Масло вершкове 73 %", "Вершки"],
                instruction: ["Перший етап", "Другий етап", "Третій етап", "Четвертий етап", "П'ятий етап"],
                category: "pershi-stravy",
                imageId: 1
            },
            {
                id: 2,
                label: "БЛІНЧИКИ З КУРКУТОМ І ГРИБАМИ",
                ingredients: ["Молоко", "Яйця курячі", "Мука пшенична", "Сіль", "Куркут", "Гриби шампіньйони"],
                instruction: ["Перший етап", "Другий етап", "Третій етап", "Четвертий етап", "П'ятий етап"],
                category: "pershi-stravy",
                imageId: 2
            },
            {
                id: 3,
                label: "ЦЕЗАР З КУРКОЮ",
                ingredients: ["Куряче філе", "Салат Айсберг", "Помідори чері", "Оливки", "Сир пармезан", "Хліб білий"],
                instruction: ["Перший етап", "Другий етап", "Третій етап", "Четвертий етап", "П'ятий етап"],
                category: "pershi-stravy",
                imageId: 3
            },
            {
                id: 4,
                label: "ЛАЗАНЬЯ З ФАРШЕМ І СИРОМ",
                ingredients: ["Лазанья", "Фарш м'ясний", "Помідори", "Цибуля", "Сир моцарелла", "Соус болоньєз"],
                instruction: ["Перший етап", "Другий етап", "Третій етап", "Четвертий етап", "П'ятий етап"],
                category: "pershi-stravy",
                imageId: 4
            },
            {
                id: 5,
                label: "САЛАТ ЦЕЗАР З КРЕВЕТКАМИ",
                ingredients: ["Креветки", "Салат Айсберг", "Хліб білий", "Сир пармезан", "Оливки", "Соус Цезар"],
                instruction: ["Перший етап", "Другий етап", "Третій етап", "Четвертий етап", "П'ятий етап"],
                category: "salaty-ta-zakusky",
                imageId: 5
            },
            {
                id: 6,
                label: "КАНАПКИ З ЛОСОСЕМ ТА СИРОМ",
                ingredients: ["Хліб вівсяний", "Лосось копчений", "Сир фета", "Авокадо", "Редиска", "Лимон"],
                instruction: ["Перший етап", "Другий етап", "Третій етап", "Четвертий етап", "П'ятий етап"],
                category: "salaty-ta-zakusky",
                imageId: 6
            },
            {
                id: 7,
                label: "САЛАТ З МОРОЗИВОМ З ПЕЧЕНИМ ЛОСОСЕМ",
                ingredients: ["Лосось філе", "Салат Романо", "Маслини", "Помідори чері", "Сир пармезан", "Бальзамічний оцет"],
                instruction: ["Перший етап", "Другий етап", "Третій етап", "Четвертий етап", "П'ятий етап"],
                category: "salaty-ta-zakusky",
                imageId: 7
            },
            {
                id: 8,
                label: "МІНІ-КІШ З ГРИБАМИ ТА СИРОМ",
                ingredients: ["Мука пшенична", "Масло вершкове 73 %", "Гриби шампіньйони", "Сир моцарелла", "Яйця курячі", "Сметана"],
                instruction: ["Перший етап", "Другий етап", "Третій етап", "Четвертий етап", "П'ятий етап"],
                category: "vipechka",
                imageId: 8
            },
            {
                id: 9,
                label: "ШАРЛОТКА З ЯБЛУКАМИ",
                ingredients: ["Яблука", "Цукор", "Мука пшенична", "Яйця курячі", "Масло вершкове 73 %", "Кориця"],
                instruction: ["Перший етап", "Другий етап", "Третій етап", "Четвертий етап", "П'ятий етап"],
                category: "vipechka",
                imageId: 9
            },
            {
                id: 10,
                label: "КРУАСАНИ З МАКОМ",
                ingredients: ["Мука пшенична", "Масло вершкове 73 %", "Мак", "Цукор", "Дріжджі", "Яйця курячі"],
                instruction: ["Перший етап", "Другий етап", "Третій етап", "Четвертий етап", "П'ятий етап"],
                category: "vipechka",
                imageId: 10
            },
            {
                id: 11,
                label: "ТОРТ 'МЕДОВИК'",
                ingredients: ["Мед", "Мука пшенична", "Цукор", "Яйця курячі", "Масло вершкове 73 %", "Сметана"],
                instruction: ["Перший етап", "Другий етап", "Третій етап", "Четвертий етап", "П'ятий етап"],
                category: "torty",
                imageId: 11
            },
            {
                id: 12,
                label: "ТОРТ 'ЧОРНА ЛІСОВА ЯГОДА'",
                ingredients: ["Мука пшенична", "Цукор", "Яйця курячі", "Смородина", "Сир маскарпоне", "Сливки 35%"],
                instruction: ["Перший етап", "Другий етап", "Третій етап", "Четвертий етап", "П'ятий етап"],
                category: "torty",
                imageId: 12
            },
            {
                id: 13,
                label: "ТОРТ 'ТРЮФЕЛЬ'",
                ingredients: ["Шоколад", "Вершки", "Цукор", "Масло вершкове 73 %", "Яйця курячі", "Мука пшенична"],
                instruction: ["Перший етап", "Другий етап", "Третій етап", "Четвертий етап", "П'ятий етап"],
                category: "torty",
                imageId: 13
            },
            {
                id: 14,
                label: "ТОРТ 'РАФАЕЛЛО'",
                ingredients: ["Кокосова стружка", "Цукор", "Сметана", "Масло вершкове 73 %", "Мука пшенична", "Яйця курячі"],
                instruction: ["Перший етап", "Другий етап", "Третій етап", "Четвертий етап", "П'ятий етап"],
                category: "torty",
                imageId: 14
            },
            {
                id: 15,
                label: "СУФЛЕ З ШОКОЛАДУ",
                ingredients: ["Шоколад", "Цукор", "Яйця курячі", "Масло вершкове 73 %", "Вершки", "Ванільний цукор"],
                instruction: ["Перший етап", "Другий етап", "Третій етап", "Четвертий етап", "П'ятий етап"],
                category: "drugi-stravy",
                imageId: 15
            },
            {
                id: 16,
                label: "РИС З ОВОЧАМИ ТА КУРКОЮ ПО-АЗІАТСЬКИ",
                ingredients: ["Рис", "Куряче філе", "Морква", "Цибуля ріпчаста", "Соєвий соус", "Часник"],
                instruction: ["Перший етап", "Другий етап", "Третій етап", "Четвертий етап", "П'ятий етап"],
                category: "drugi-stravy",
                imageId: 16
            },
            {
                id: 17,
                label: "КОТЛЕТИ ПО-КИЇВСЬКИ",
                ingredients: ["Філе куряче", "Масло вершкове 73 %", "Петрушка", "Сир Гауда", "Хліб білий", "Яйця курячі"],
                instruction: ["Перший етап", "Другий етап", "Третій етап", "Четвертий етап", "П'ятий етап"],
                category: "drugi-stravy",
                imageId: 17
            },
            {
                id: 18,
                label: "СУП З ГРИБАМИ ТА КРЕМ-СИРОМ",
                ingredients: ["Гриби шампіньйони", "Крем-сир", "Цибуля", "Масло вершкове 73 %", "Картопля", "Сметана"],
                instruction: ["Перший етап", "Другий етап", "Третій етап", "Четвертий етап", "П'ятий етап"],
                category: "drugi-stravy",
                imageId: 18
            },
            {
                id: 19,
                label: "ЗАПІКАНКА З КАРТОПЛЕЮ ТА КУРКОЮ",
                ingredients: ["Куряче філе", "Картопля", "Молоко", "Сир моцарелла", "Цибуля", "Петрушка"],
                instruction: ["Перший етап", "Другий етап", "Третій етап", "Четвертий етап", "П'ятий етап"],
                category: "drugi-stravy",
                imageId: 19
            },
            {
                id: 20,
                label: "ОЛАДКИ З ТВОРОГОМ",
                ingredients: ["Творог", "Яйця курячі", "Цукор", "Мука пшенична", "Сметана", "Масло вершкове 73 %"],
                instruction: ["Перший етап", "Другий етап", "Третій етап", "Четвертий етап", "П'ятий етап"],
                category: "drugi-stravy",
                imageId: 20
            },
            
            {
                id: 21,
                label: "Морс з полуниць",
                ingredients: ["Свіжі полуниці", "Цукор", "Вода", "Лимонний сік"],
                instruction: ["Підготуйте імбирний сироп", "Зберіть полуничний сік", "Додайте лимонний сік", "Розлейте у склянки", "Подайте з льодом"],
                category: "napoi",
                imageId: 21
            },
            {
                id: 22,
                label: "Гарячий шоколад з маршмелоу",
                ingredients: ["Молоко", "Какао", "Цукор", "Маршмелоу"],
                instruction: ["Загрійте молоко", "Додайте какао та цукор", "Збийте маршмелоу", "Подайте зверху на гарячий шоколад"],
                category: "napoi",
                imageId: 22
            },
            {
                id: 23,
                label: "Лимонад з м'ятою",
                ingredients: ["Лимони", "Цукор", "Вода", "М'ята"],
                instruction: ["Вижміть сік з лимонів", "Додайте цукор та воду", "Додайте м'яту", "Зберіть у склянці з льодом"],
                category: "napoi",
                imageId: 23
            },
            {
                id: 24,
                label: "Холодний чай з лимоном",
                ingredients: ["Чорний чай", "Лимон", "Цукор", "Лід"],
                instruction: ["Заваріть чорний чай", "Додайте цукор та лимон", "Охолодіть", "Подайте з льодом"],
                category: "napoi",
                imageId: 24
            },
            {
                id: 25,
                label: "Кава Фраппе",
                ingredients: ["Кавові зерна", "Молоко", "Цукор", "Лід"],
                instruction: ["Змеліть кавові зерна", "Додайте молоко та цукор", "Зберіть з льодом в блендері", "Подайте у склянці"],
                category: "napoi",
                imageId: 25
            }
        ]
    })   
)

export {useRecipes};